/*
* @Author: duqinzhi
* @Date:   2018-04-30 16:59:41
* @Last Modified by:   duqinzhi
* @Last Modified time: 2018-05-01 11:14:51
*/
/**数组的解构赋值
 * 1.设置默认值（只有后面解构得值是undefined的时候，才会走默认值）
 * 2.省略赋值(省略的值用逗号隔开就行)
 * 3.//不定参数赋值(将后面的项放在一个数组中赋值给y3=[3,4,5])
 */
	let arr = [1,2,3,4];
	// let x = arr[0];
	// let y = arr[1]
	// let m = arr[2];
	// let n = arr[3];  //我们要获取数组中的每个值，要么就要和这个取，或者循环
	
	let [x,y,m,n] = arr;  //解构出来的值赋值给x,y,m,n
	console.log(x,y,m,n);

	//设置默认值（只有后面解构得值是undefined的时候，才会走默认值）
	let[x1,x2=10] = [1,2];  //当后面有解构的值的时候，不看默认值，解构值为undefined的时候才会去看默认值
	console.log(x1,x2);

	//省略赋值(省略的值用逗号隔开就行)
	let[,,x3] = [1,2,3];

	//不定参数赋值(将后面的项放在一个数组中赋值给y3=[3,4,5])
	let [y1,y2,...y3] = [1,2,3,4,5]; //此时会将3,4,5组成一个数组给y3
	console.log(y3);